`
1. 각 성적별 가중치가 주어져 있고 (A+는 10 등), 각 과목의 점수가 입력으로 주어졌을때
각 과목의 가중치 * 점수의 값을 구하는 문제
문제만 정확히 읽었다면 몇 분 안걸려서 통과할 수 있는 문제였다.
난이도: 2/10


2. 주어진 숫자 문자열과 사칙연산 기호가 주어지고, 문자열을 2개로 분할 후,
주어진 사칙연산 기호로 계산한 모든 결과값을 출력하는 문제
이것 또한 문자열 2개로 분할하는 모든 경우만 구하면 되어서 몇 분 안걸려서 
통과할 수 있는 문제였다.
난이도: 2/10


3. 전통적인 투자 기법인 마틴매매법 문제였다.
(잃으면 2배로 돈을 걸고, 돈을 벌면 초기 투자금으로 새로 시작)
즉, 1000원을 걸어서 맞추면 +1000 후 다시 1000원을 걸고
1000원을 걸어서 틀리면 -1000 후 2배인 2000원을 거는 방식이다.
주어진 입력값대로 실행한 후, 남은 결과를 출력하는 문제였다. 
조건문 몇개를 잘못걸어서 구현에러가 몇 번 발생했던 것 같다. 난이도: 3/10


4. NxN 보드에 숫자들이 있고 커서를 최소로 이동하여
1부터 9까지 타겟 숫자를 지우는 문제였다.
(보드의 끝을 벗어나면 반대편 첫번째로 이등가능)
한좌표에서 다른좌표로 갈 수 있는 최소거리를 구할 수 있다면 쉽게 해결 할 수 있다. 
난이도: 3/10


5. 데이터 통신 시간에 본듯한 패킷의 데이터를 패딩하는 문제였다.
데이터의 앞과 뒤에 특정 코드를 삽입하는데 데이터 내에 그 특정코드와
같은 코드가 있으면 앞에 다른 특정 코드를 삽입시켜주는 문제였다.
전공지식이라 문제를 쉽게해결 할 수 있었으나 전공이 아니었으면
문제를 이해하는 것이 잠시 헷갈렸을 것 같다.
난이도: 3/10


6. 시험 부정행위자를 찾아내는 문제였다.
부정행위에 대한 조건이 있었으며 조건에 부합하는 후보들을 정렬하여 출력하는 문제였다.
단순 구현문제인줄 알았는데, 코드를 작성하다보니 꽤 복잡한 구현문제였다.
난이도: 5/10


7. 로봇청소기 문제로,
nxn보드를 로봇에 대각선으로 움직이는데 그 순서를 보드에 기록하는 문제였다.
복잡한 트릭은 없고 로봇청소기가 보드의 가장자리에 있을 때에만
if문 처리를 잘해주면 바로 통과할 수 있었다.
난이도 4/10
`;
